In [41]:
import pandas as pd
import numpy as np
import statistics as stat

In [2]:
data = pd.read_csv('archive/spam_ham_dataset.csv', sep = ',')
data.head()

,Unnamed: 0,label,text,label_num
0,605,ham,Subject: enron methanol ; meter # : 988291\r\n...,0
1,2349,ham,"Subject: hpl nom for january 9 , 2001\r\n( see...",0
2,3624,ham,"Subject: neon retreat\r\nho ho ho , we ' re ar...",0
3,4685,spam,"Subject: photoshop , windows , office . cheap ...",1
4,2030,ham,Subject: re : indian springs\r\nthis deal is t...,0

In [3]:
data.rename(columns={"Unnamed: 0": "id"})

        id label                                               text  label_num
0      605   ham  Subject: enron methanol ; meter # : 988291\r\n...          0
1     2349   ham  Subject: hpl nom for january 9 , 2001\r\n( see...          0
2     3624   ham  Subject: neon retreat\r\nho ho ho , we ' re ar...          0
3     4685  spam  Subject: photoshop , windows , office . cheap ...          1
4     2030   ham  Subject: re : indian springs\r\nthis deal is t...          0
...    ...   ...                                                ...        ...
5166  1518   ham  Subject: put the 10 on the ft\r\nthe transport...          0
5167   404   ham  Subject: 3 / 4 / 2000 and following noms\r\nhp...          0
5168  2933   ham  Subject: calpine daily gas nomination\r\n>\r\n...          0
5169  1409   ham  Subject: industrial worksheets for august 2000...          0
5170  4807  spam  Subject: important online banking alert\r\ndea...          1

[5171 rows x 4 columns]

In [10]:
for i in range(len(data)):
    data.iloc[i,4] = len(data.iloc[i,2])

In [11]:
data.head()

,Unnamed: 0,label,text,label_num,length
0,605,ham,Subject: enron methanol ; meter # : 988291\r\n...,0,327
1,2349,ham,"Subject: hpl nom for january 9 , 2001\r\n( see...",0,97
2,3624,ham,"Subject: neon retreat\r\nho ho ho , we ' re ar...",0,2524
3,4685,spam,"Subject: photoshop , windows , office . cheap ...",1,414
4,2030,ham,Subject: re : indian springs\r\nthis deal is t...,0,336

In [43]:
len_arr = []
for i in range(1000):
    len_arr.append(int(data.iloc[i,[4]]))

In [44]:
np.mean(len_arr)

1082.892

In [45]:
stat.median(len_arr)

549.0